using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
//ИСП-23, Бирюков Георгий, 25.11.2021
//Дана последовательность целых чисел, оканчивающаяся числом -1.
//Количество чисел в последовательности не меньше двух.
//Определить, есть ли в ней хотя бы одна пара "соседних" четных чисел.
//В случае положительного ответа определить порядковые номера чисел последней из таких пар.

namespace Адовые_коды__7__Практическая_намбер_севен
{
    class Program
    {
        static void Main(string[] args)
        {
            int x = 1,
               n,
               one,
               por1 = 0, //Порядковый номер первого числа пары
               por = 0, //Порядковый номер второго числа пары
               kol = 0; //Счетчик
            Console.WriteLine("Введите последовательность чисел (не меньше 2)");
            Console.WriteLine("(для закрытия программы -1)");
            do
            {
                n = x;
                one = kol;

                kol++;

                x = Convert.ToInt32(Console.ReadLine()); //Ввод числа в последовательность

                //Условие для определения пары четных чисел

                if (x % 2 == 0 && n % 2 == 0)
                {
                    por = kol;
                    por1 = one;
                }


            } while (x != -1);
            if (por > 1 && por1 > 1) //Условие для вывода последней пары четных чисел
            {
                Console.WriteLine("Пара четных чисел под порядковыми номерами {por1} и {por}");
            }
            else //Вывод при отсутствии четных пар
            {
                Console.WriteLine("Таких пар нет");
            }
            Console.ReadKey();
        }
    }
}
